[
  {
    "id": 0,
    "title": " Prayer of Ibrahimؑ  for the dwellers of Makkah",
    "description": " إِذ قالَ إِبراهيمُ رَبِّ اجعَل هٰذا بَلَدًا آمِنًا وَارزُق أَهلَهُ مِنَ الثَّمَراتِ مَن آمَنَ مِنهُم بِاللَّهِ وَاليَومِ الآخِرِ\nWhen Abraham said, O My Lord, make this a peaceful land, and provide its people with fruits—whoever of them believes in God and the Last Day."
  },

  {
    "id": 1,
    "title": " Prayer of Ibrahimؑ  when raising foundations of Kaaba",
    "description": "وَإِذ يَرفَعُ إِبراهيمُ القَواعِدَ مِنَ البَيتِ وَإِسماعيلُ رَبَّنا تَقَبَّل مِنّا ۖ إِنَّكَ أَنتَ السَّميعُ العَليم\n ُAnd [mention] when Abraham was raising the foundations of the House and [with him] Ishmael, [saying], Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing. "
  },
  {
    "id": 2,
    "title": "* Ibrahimؑ 's Prayer for his descendants",
    "description": "رَبَّنا وَاجعَلنا مُسلِمَينِ لَكَ وَمِن ذُرِّيَّتِنا أُمَّةً مُسلِمَةً لَكَ وَأَرِنا مَناسِكَنا وَتُب عَلَينا ۖ إِنَّكَ أَنتَ التَّوّابُ الرَّحيمُ\nMy Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, and accept my supplication."
  },
  {
    "id": 3,
    "title": "* Ibrahimؑ 's Prayer for Muhammad ﷺ",
    "description": " رَبَّنا وَابعَث فيهِم رَسولًا مِنهُم يَتلو عَلَيهِم آياتِكَ وَيُعَلِّمُهُمُ الكِتابَ وَالحِكمَةَ وَيُزَكّيهِم ۚ إِنَّكَ أَنتَ العَزيزُ الحَكيمُ\nOur Lord, and raise up among them a messenger, of themselves, who will recite to them Your revelations, and teach them the Book and wisdom, and purify them. You are the Almighty, the Wise."
  },
  {
    "id": 4,
    "title": "* Give us Our Lord best of this world and the hereafter",
    "description": " رَبَّنا آتِنا فِي الدُّنيا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنا عَذابَ النّارِ\nOur Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire."
  },
  {
    "id": 5,
    "title": "* Prayer for patience and firmness.",
    "description": "رَبَّنا أَفرِغ عَلَينا صَبرًا وَثَبِّت أَقدامَنا وَانصُرنا عَلَى القَومِ الكافِرينَ\nOur Lord, pour upon us patience and plant firmly our feet and give us victory over the disbelieving people"
  },
  {
    "id": 6,
    "title": "* Prayer for forgiveness of our errors",
    "description": "رَبَّنا لا تُؤاخِذنا إِن نَسينا أَو أَخطَأنا\nOur Lord, do not impose blame upon us if we have forgotten or erred 2:286."
  },
  {
    "id": 7,
    "title": "* Prayer to not burden like the generation before us",
    "description": "رَبَّنا وَلا تَحمِل عَلَينا إِصرًا كَما حَمَلتَهُ عَلَى الَّذينَ مِن قَبلِنا\nOur Lord, and lay not upon us a burden like that which You laid upon those before us"
  },
  {
    "id": 8,
    "title": "* Prayer for mercy and victory",
    "description": "رَبَّنا وَلا تُحَمِّلنا ما لا طاقَةَ لَنا بِهِ ۖ وَاعفُ عَنّا وَاغفِر لَنا وَارحَمنا ۚ أَنتَ مَولانا فَانصُرنا عَلَى القَومِ الكافِرينَ\nOur Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people"
  },
  {
    "id": 9,
    "title": "* Our Lord, do not cause our hearts to deviate",
    "description": "رَبَّنا لا تُزِغ قُلوبَنا بَعدَ إِذ هَدَيتَنا وَهَب لَنا مِن لَدُنكَ رَحمَةً ۚ إِنَّكَ أَنتَ الوَهّابُ\nOur Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower."
  },
  {
    "id": 10,
    "title": " * We acknowledge the day of resurrection",
    "description": "رَبَّنا إِنَّكَ جامِعُ النّاسِ لِيَومٍ لا رَيبَ فيهِ ۚ إِنَّ اللَّهَ لا يُخلِفُ الميعادَ\nOur Lord, You will gather the people for a Day in which there is no doubt.Indeed, Allah does not fail in His promise"
  },
  {
    "id": 11,
    "title": "* Our Lord, indeed we have believed ..",
    "description": "رَبَّنا إِنَّنا آمَنّا فَاغفِر لَنا ذُنوبَنا وَقِنا عَذابَ النّارِ\nOur Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire,"
  },
  {
    "id": 12,
    "title": "* Prayer of disciples of Jesus",
    "description": "رَبَّنا آمَنّا بِما أَنزَلتَ وَاتَّبَعنَا الرَّسولَ فَاكتُبنا مَعَ الشّاهِدينَ\nOur Lord, we have believed in what You have revealed, and we have followed the Messenger, so count us among the witnesses"
  },
  {
    "id": 13,
    "title": "* Prayer of supporters of Prophets",
    "description": "رَبَّنَا اغفِر لَنا ذُنوبَنا وَإِسرافَنا في أَمرِنا وَثَبِّت أَقدامَنا وَانصُرنا عَلَى القَومِ الكافِرينَ\nOur Lord, forgive us our sins and the excess [committed] in our affairs and plant firmly our feet and give us victory over the disbelieving people."
  },
  {
    "id": 14,
    "title": "* Prayer of the believers",
    "description": "رَبَّنا ما خَلَقتَ هٰذا باطِلًا سُبحانَكَ فَقِنا عَذابَ النّارِ\nOur Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire."
  },
  {
    "id": 15,
    "title": "* Our Lord, forgive our sins",
    "description": "رَبَّنا فَاغفِر لَنا ذُنوبَنا وَكَفِّر عَنّا سَيِّئَاتِنا وَتَوَفَّنا مَعَ الأَبرارِ\nOur Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous."
  },
  {
    "id": 16,
    "title": "14. Our Lord, we have believed",
    "description": "رَبَّنا وَآتِنا ما وَعَدتَنا عَلىٰ رُسُلِكَ وَلا تُخزِنا يَومَ القِيامَةِ ۗ إِنَّكَ لا تُخلِفُ الميعادَ\nOur Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise."
  },
  {
    "id": 17,
    "title": "* Prayer of Jesusؑ",
    "description": "اللَّهُمَّ رَبَّنا أَنزِل عَلَينا مائِدَةً مِنَ السَّماءِ تَكونُ لَنا عيدًا لِأَوَّلِنا وَآخِرِنا وَآيَةً مِنكَ ۖ وَارزُقنا وَأَنتَ خَيرُ الرّازِقينَ\nSaid Jesus, the son of Mary, O Allah, our Lord, send down to us a table [spread with food] from the heaven to be for us a festival for the first of us and the last of us and a sign from You. And provide for us, and You are the best of providers."
  },
  {
    "id": 18,
    "title": "* Prayer of repentence",
    "description": "رَبَّنا ظَلَمنا أَنفُسَنا وَإِن لَم تَغفِر لَنا وَتَرحَمنا لَنَكونَنَّ مِنَ الخاسِرينَ\nOur Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers."
  },
  {
    "id": 19,
    "title": "* Asking help for artibtration",
    "description": " رَبَّنَا افتَح بَينَنا وَبَينَ قَومِنا بِالحَقِّ وَأَنتَ خَيرُ الفاتِحينَ\nOur Lord, decide between us and our people in truth, and You are the best of those who give decision."
  },
  {
    "id": 20,
    "title": "* Prayer of the followers of Mosesؑ",
    "description": "عَلَى اللَّهِ تَوَكَّلنا رَبَّنا لا تَجعَلنا فِتنَةً لِلقَومِ الظّالِمينَ وَنَجِّنا بِرَحمَتِكَ مِنَ القَومِ الكافِرينَ\nUpon Allah do we rely. Our Lord, make us not [objects of] trial for the wrongdoing people,And save us by Your mercy from the disbelieving people."
  },
  {
    "id": 21,
    "title": "* Prayer of Ibrahimؑ safeguarging against idol worshiping",
    "description": "رَبِّ اجعَل هٰذَا البَلَدَ آمِنًا وَاجنُبني وَبَنِيَّ أَن نَعبُدَ الأَصنامَ\nAnd [mention, O Muhammad], when Abraham said, My Lord, make this city [Makkah] secure and keep me and my sons away from worshipping idols."
  },
  {
    "id": 22,
    "title": "* Ibrahimؑ prayer for his family after migrating to Makkah",
    "description": "رَبَّنا إِنّي أَسكَنتُ مِن ذُرِّيَّتي بِوادٍ غَيرِ ذي زَرعٍ عِندَ بَيتِكَ المُحَرَّمِ رَبَّنا لِيُقيمُوا الصَّلاةَ فَاجعَل أَفئِدَةً مِنَ النّاسِ تَهوي إِلَيهِم وَارزُقهُم مِنَ الثَّمَراتِ لَعَلَّهُم يَشكُرونَ\nOur Lord, I have settled some of my descendants in an uncultivated valley near Your sacred House, our Lord, that they may establish prayer. So make hearts among the people incline toward them and provide for them from the fruits that they might be grateful."
  },
  {
    "id": 23,
    "title": "* Ibrahimؑ's prayer for his descendants and parents",
    "description": "رَبِّ اجعَلني مُقيمَ الصَّلاةِ وَمِن ذُرِّيَّتي ۚ رَبَّنا وَتَقَبَّل دُعاءِ رَبَّنَا اغفِر لي وَلِوالِدَيَّ وَلِلمُؤمِنينَ يَومَ يَقومُ الحِسابُ\nMy Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, and accept my supplication، Our Lord, forgive me and my parents and the believers the Day the account is established."
  },
  {
    "id": 24,
    "title": "* Prayer of youths of cave",
    "description": "رَبَّنا آتِنا مِن لَدُنكَ رَحمَةً وَهَيِّئ لَنا مِن أَمرِنا رَشَدًا\nOur Lord, grant us from Yourself mercy and prepare for us from our affair right guidance."
  },
  {
    "id": 25,
    "title": "* Prayers of people of Paradise",
    "description": "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ\nOur Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful. 23:110"
  },
  {
    "id": 26,
    "title": "* Prayer for safety against Hell fire",
    "description": "رَبَّنَا اصرِف عَنّا عَذابَ جَهَنَّمَ ۖ إِنَّ عَذابَها كانَ غَرامًا\nOur Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering. 25:65"
  },
  {
    "id": 27,
    "title": "* O Lord Make our family comfort of our eyes",
    "description": "رَبَّنا هَب لَنا مِن أَزواجِنا وَذُرِّيّاتِنا قُرَّةَ أَعيُنٍ وَاجعَلنا لِلمُتَّقينَ إِمامًا\nOur Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous. 25:74"
  },
  {
    "id": 28,
    "title": "* Prayer of rightous people for the believers passed before",
    "description": "رَبَّنَا اغفِر لَنا وَلِإِخوانِنَا الَّذينَ سَبَقونا بِالإيمانِ وَلا تَجعَل في قُلوبِنا غِلًّا لِلَّذينَ آمَنوا رَبَّنا إِنَّكَ رَءوفٌ رَحيمٌ\nOur Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful. 59:10"
  }
  ]